ERM/src/InformationRegisters/ДатыПервыхПроводокПоInvoicedDebts/ДатыПервыхПроводокПоInvoicedDebts.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДатыПервыхПроводокПоInvoicedDebts</name>
  <resources>
    <name>ДатаПроводки</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>Проводка</name>
    <type>
      <types>DocumentRef.ТранзакцияHOB</types>
      <types>DocumentRef.ТранзакцияOracle</types>
      <types>DocumentRef.ПроводкаDSS</types>
    </type>
  </attributes>
  <dimensions>
    <name>Invoice</name>
    <type>
      <types>DocumentRef.Invoice</types>
      <types>DocumentRef.SalesOrder</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERM/src/InformationRegisters/ДатыПервыхПроводокПоInvoicedDebts/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Функция ДатаПервойПроводкиПоДокументу(Документ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДатыПервыхПроводокПоInvoicedDebts.ДатаПроводки
		|ИЗ
		|	РегистрСведений.ДатыПервыхПроводокПоInvoicedDebts КАК ДатыПервыхПроводокПоInvoicedDebts
		|ГДЕ
		|	ДатыПервыхПроводокПоInvoicedDebts.Invoice = &Invoice";
	
	Запрос.УстановитьПараметр("Invoice", Документ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	Возврат ВыборкаДетальныеЗаписи.ДатаПроводки;
	
КонецФункции

Процедура ОчиститьЗаписьПоПроводке(Документ, Проводка) Экспорт
	
	НЗ = РегистрыСведений.ДатыПервыхПроводокПоInvoicedDebts.СоздатьНаборЗаписей();
	НЗ.Отбор.Invoice.Установить(Документ);
	НЗ.Прочитать();
	
	Если НЗ.Количество() = 0 ИЛИ НЗ[0].Проводка <> Проводка Тогда
		Возврат;
	КонецЕсли;
	
	НЗ.Очистить();
	НЗ.Записать(Истина);
	
КонецПроцедуры


#КонецЕсли
